const { cmd, commands } = require("../command");
const config = require('../config');

cmd(
  {
    pattern: "menu",
    react: "📂",
    alise: ["getmenu"],
    desc: "get cmd list",
    category: "main",
    filename: __filename,
  },
  async (
    robin,
    mek,
    m,
    {
      from,
      quoted,
      body,
      isCmd,
      command,
      args,
      q,
      isGroup,
      sender,
      senderNumber,
      botNumber2,
      botNumber,
      pushname,
      isMe,
      isOwner,
      groupMetadata,
      groupName,
      participants,
      groupAdmins,
      isBotAdmins,
      isAdmins,
      reply,
    }
  ) => {
    try {
      let menu = {
        main: "",
        download: "",
        group: "",
        owner: "",
        convert: "",
        search: "",
      };

      for (let i = 0; i < commands.length; i++) {
        if (commands[i].pattern && !commands[i].dontAddCommandList) {
          menu[
            commands[i].category
          ] += `${config.PREFIX}${commands[i].pattern}\n`;
        }
      }

      let madeMenu = `
┏━━━━━━━━━━━━━━━━━━━━⚔
┃  🧚‍♂️ 𝓱𝓮𝓵𝓵𝓸𝓮  ${pushname}                                                   
┣━━━━👑𝙾𝚂𝙷𝙸𝚈𝙰-𝙼𝙳👑━━━━━━⚔
┃    
┃    ┌┅𝘔𝘈𝘐𝘕 𝘊𝘖𝘔𝘔𝘈𝘕𝘋𝘚┅┐
┃     
┃     📃 .ᴍᴇɴᴜ
┃     📃 .ᴀʟɪᴠᴇ
┃     📃 .ᴘɪɴɢ
┃     📃 .ᴏᴡɴᴇʀ
┃     📃 .ꜱʏꜱᴛᴇᴍ
┃
┣━━━━━━━━━━━━━━━━━━━━━━━━╮
┃
┃ ┌┅𝘋𝘖𝘞𝘕𝘓𝘖𝘈𝘋 𝘊𝘖𝘔𝘔𝘈𝘕𝘋𝘚┅┐
┃
┃     🚀 .ꜱᴏɴɢ (ᴛᴇxᴛ) ᴏʀ (ᴜʀʟ)
┃     🚀 .ᴠɪᴅᴇᴏ (ᴛᴇxᴛ) ᴏʀ (ᴜʀʟ)
┃     🚀 .ꜰʙ (ᴜʀʟ)
┣━━━━━━━━━━━━━━━━━━━━━━━━╯
┃
┃  ┌┅𝘊𝘖𝘕𝘝𝘌𝘙𝘛 𝘊𝘖𝘔𝘔𝘈𝘕𝘋𝘚┅┐
┃
┃  ♻️ .ꜱᴛɪᴄᴋᴇʀ (ʀᴇᴘʟʏ ᴛᴏ ᴘɪᴄᴛᴜʀᴇ)
┃  ♻️ .ɪᴍɢ         (ʀᴇᴘʟʏ ᴛᴏ ꜱᴛɪᴄᴋᴇʀ)
┣━━━━━━━━━━━━━━━━━━━━━━━━╮
┃
┃   ┌┅┅𝘖𝘞𝘕𝘌𝘙 𝘊𝘖𝘔𝘔𝘈𝘕𝘋𝘚┅┅┐
┃
┃    ☣️ .ʀᴇꜱᴛᴀʀᴛ
┃    ☣️ .ꜱᴇᴛᴛɪɴɢ
┣━━━━━━━━━━━━━━━━━━━━━━━━╯
┃
┃    ┌┅┅𝘎𝘙𝘖𝘜𝘗 𝘊𝘖𝘔𝘔𝘈𝘕𝘋𝘚┅┅┐
┃
┃    🛡️ .ʙʟᴏᴄᴋ
┃    🛡️ .ᴋɪᴄᴋ
┃    🛡️ .ʟᴇꜰᴛ
┃    🛡️ .ᴍᴜᴛᴇ , .ᴜɴᴍᴜᴛᴇ
┃    🛡️ .ᴀᴅᴅ
┃    🛡️ .ᴅᴇᴍᴏᴛᴇ , .ᴘʀᴏᴍᴏᴛᴇ
┗━━━━━━━━━━━━━━━━━━━━━━━━⚔
`;
      await robin.sendMessage(
        from,
        {
          image: {
            url: "https://raw.githubusercontent.com/oshadha12345/images/refs/heads/main/bot_menu.png",
          },
          caption: madeMenu,
        },
        { quoted: mek }
      );
    } catch (e) {
      console.log(e);
      reply(`${e}`);
    }
  }
);
